modules/users/models/User.php

SELECT * FROM `user` WHERE `id`=119
---
    public static function getCurrentUser(){
        $userId = Yii::$app->getUser()->getId();
        return self::findOne($userId);