modules/contract/models/Contract.php

    public function getContractSetting()
    {
        return $this->getContractSettings()->one();
---
SELECT * FROM `contract_settings` WHERE `contract_id`=63