modules/contract/views/frontend/order/_create_form.php

SELECT * FROM `direction` WHERE `parent_id` IS NULL
SELECT * FROM `direction` WHERE `parent_id` IS NOT NULL
SELECT * FROM `direction` WHERE `id`=25
SELECT * FROM `order_has_direction` WHERE `order_id`='4'
---
            <div class="col-sm-8 ">
                <div class="order-direction direction-block col-sm-12">
                    <?
                    $directions = ArrayHelper::map(Direction::find()->andWhere(['parent_id'=>null])->all(), 'id', 'name');
                    $subdirections = Direction::find()->where(['is not', 'parent_id', null])->all();
                    $ohds = OrderHasDirection::find()->where([
                        'order_id' => $orderId,
                    ])->all();

SELECT * FROM `direction` WHERE `parent_id`=1
---
                            <?
                            echo DepDrop::widget([
                                'name' => 'order-subdirection',
                                'data' => ArrayHelper::map(Direction::find()->where(['parent_id' => key($directions)])->all(), 'id', 'name'),

SELECT * FROM `currency`
---
                <?=$form->field($model, 'budget')->textInput(['class'=>''])->label(false)?>
            </div>
            <div class="col-sm-2">
                <?=$form->field($model, 'currency_id')->dropDownList(ArrayHelper::map(Currency::find()->all(), 'id', 'name'))->label(false)?>