common/components/User.php

    public function getRole(){
        if(\Yii::$app->getUser()->getIsGuest())
            return false;
        $user = \modules\users\models\User::findOne(\Yii::$app->getUser()->id);
---
SELECT * FROM `user` WHERE `id`=119