frontend/widgets/Lang/LangWidget.php

SELECT * FROM `lang`
---
    public function run() {
        $curLang = Lang::getCurrent();
        return $this->render('view', [
            'current' => Lang::getCurrent(),
//            'langs' => Lang::find()->where('id != :current_id', [':current_id' => Lang::getCurrent()->id])->all(),
            'langs' => Lang::find()->all(),