modules/users/widgets/userinfo/UserinfoWidget.php

    public function run(){
        $userId = \Yii::$app->getUser()->getId();
        if($user = User::findOne($userId)){
---
SELECT * FROM `user` WHERE `id`=119