modules/contract/widgets/filter/views/_territory.php

SELECT * FROM `country`
SELECT * FROM `state` WHERE `country_id` IS NULL
SELECT * FROM `city`
---
$stateId = Yii::$app->getRequest()->post('filter_territory_state');
$cityId = Yii::$app->getRequest()->post('filter_territory_city');

$countries = Country::find()->all();
$states = State::find()->where(['country_id'=>$countryId])->all();
$cities = City::find();