modules/contract/controllers/CommentController.php

SELECT * FROM `contract` WHERE `id` IS NULL
---
    public function actionIndex($contractId){
        $contract = Contract::findOne($contractId);