modules/contract/controllers/OrderController.php

    public function actionUpdate(){
        $orderId = Yii::$app->getRequest()->post('orderId');
        $model = new OrderFormUpdate();
        $order = Order::findOne($orderId);
---
SELECT * FROM `order` WHERE `id`='4'