modules/contract/controllers/PerformerController.php

    public function actionOfferOrder($contractId){
        $orders = Order::find()->all();
        $model = Contract::findOne($contractId);
---
SELECT * FROM `order`
SELECT * FROM `contract` WHERE `id`='64'