modules/direction/models/Direction.php

SELECT * FROM `direction` ORDER BY `parent_id`, `name`
---
    public static function getTree()
    {
        $models = self::find()->orderBy(['parent_id' => 'ASC', 'name' => 'ASC'])->all();

SELECT * FROM `directionlang` WHERE direction_id=1 AND lang_id=1
---
    public function getDirectionlangByLang($langId=null)
    {
        return Directionlang::getDirectionlangByDirectionAndLang($this->id, $langId)->one();