modules/contract/widgets/actionButtons/performers/FavoriteAddButton.php

SELECT * FROM `favorite_company` WHERE (`contract_id`=63) AND (`favorite_contract_id`=64)
---
    public function init()
    {
        $currentContract = Contract::getCurContract();
        $favoriteCompany = FavoriteCompany::find()->where([
            'contract_id' => $currentContract->id,
            'favorite_contract_id' => $this->model->id,
        ])->one();