<div class="ad"><a href="#">Реклама</a></div>

<div class="content-block">
    <h1>О проекте</h1>
    <p>Открытие станции «Тропарёво» Сокольнической линии московского метро состоится в период с 24 по 30 ноября. Об этом информагенству «Москва» сообщили в пресс-службе департамента строительства.</p>
    <p>«На станции завершён монтаж оборудования. Ведутся пуско-наладочные работы. Открытие состоится в последнюю неделю ноября», — заявили в ведомстве.</p>
    <p>«Тропарёво» — односводчатая станция мелкого заложения (глубиной 12 метров), которая располагается на чётной стороне Ленинского проспекта. Когда она откроется, из юго-западного вестибюля можно будет выйти к жилому микрорайону по нечётной стороне Ленинского проспекта, а из северо-восточного — на чётную сторону, к Рузской улице и Тропарёвскому лесопарку.</p>
    <p>Перронный зал новой станции спроектировали в виде парковой аллеи, а в кассовых залах над турникетами установили светящиеся панно, имитирующие переплетение крон деревьев. Станцию также оснастили системой лифтов для маломобильных граждан.</p>
    <p>Ранее департамент строительства объявлял, что станция заработает в первой половине ноября.</p>
</div>