modules/contract/views/performer/settings/_form.php

        ?>
        <div class="region-add" style="display: <?=$display?>">
            <?
            $settingsRegions = ContractSettingsRegion::find()->where([
                'setting_id' => $setting->id,
            ])->all();
            foreach($settingsRegions as $region):
                $fullRegionName = $region->country ? $region->country->name : '';
---
SELECT * FROM `contract_settings_region` WHERE `setting_id`=2
SELECT * FROM `country` WHERE `id`=1

                    <p><?=$model->getAttributeLabel('country')?><span>*</span></p>
                </div>
                <div class="col-sm-8 country-select">
                    <?=$form->field($model, 'country', ['options'=>['class'=>'']])->dropDownList(ArrayHelper::map(Country::find()->all(), 'id', 'name'), [
                        'id'=>'settingsform-country',
                        'class' => 'region-add-country',
                        'prompt' => $model->getAttributeLabel('country'),
                    ])->label(false)->error(false)?>
---
SELECT * FROM `country`

                    <p><?=$model->getAttributeLabel('state')?><span>*</span></p>
                </div>
                <div class="col-sm-8 region-select">
                    <?= $form->field($model, 'state', ['options'=>['class'=>'']])->widget(DepDrop::classname(), [
                        'data'=> ArrayHelper::map(State::find()->where(['country_id'=>$model->country])->all(), 'id', 'name'),
                        'options'=>[
                            'id'=>'settingsform-state',
                            'prompt' => $model->getAttributeLabel('state'),
                            'class' => 'region-add-state',
                        ],
                        'pluginOptions'=>[
                            'depends'=>['settingsform-country'],
                            'placeholder' => $model->getAttributeLabel('state'),
                            'url'=>'/users/guest/get-states/',
                        ],
                        'pluginEvents' => [
                            "depdrop.afterChange"=>"function(event, id, value) {
                        var oDropdown = $('#settingsform-state').msDropdown().data('dd');
                        oDropdown.destroy();
                        oDropdown = $('#settingsform-state').msDropdown().data('dd');
                        oDropdown.refresh();
                    }",
                        ],
                    ])->label(false)->error(false);?>
---
SELECT * FROM `state` WHERE `country_id` IS NULL

                </div>
                <div class="col-sm-8 city-select">
                    <?
                    $cities = City::find();
---
SELECT * FROM `city`